{
  "id": "dpia_requirement_v1",
  "title": "DPIA Requirement Check",
  "description": "Helps decide whether a Data Protection Impact Assessment (DPIA) is required based on the nature of processing. This is a generic, jurisdiction-neutral guide.",
  "root": "personal_data",
  "nodes": {
    "personal_data": {
      "text": "Does this activity involve processing personal data?",
      "type": "choice",
      "options": {
        "No": {
          "decision": "NO_DPIA_REQUIRED",
          "explanation": "If no personal data is processed, a DPIA is not required. You may still document a basic risk assessment for governance purposes."
        },
        "Yes": {
          "next": "high_risk_characteristics"
        }
      }
    },
    "high_risk_characteristics": {
      "text": "Does the processing involve any of the following high-risk characteristics?\n\n- Systematic monitoring (e.g. CCTV, tracking, monitoring behaviour)\n- Large-scale processing of personal data\n- Special category / highly sensitive data (health, biometrics, children, financial, criminal)\n- Vulnerable individuals or power imbalance (patients, employees, students, beneficiaries)\n- Use of new or intrusive technology (AI profiling, behavioural scoring, monitoring tools)",
      "type": "choice",
      "options": {
        "Yes, one or more apply": {
          "decision": "DPIA_REQUIRED",
          "explanation": "Your processing has one or more high-risk characteristics. A DPIA is strongly recommended and may be mandatory under many data protection regimes."
        },
        "No, none apply": {
          "next": "borderline_context"
        }
      }
    },
    "borderline_context": {
      "text": "Even if none of the high-risk characteristics clearly apply, is there any context that still makes this activity feel risky (e.g. reputational risk, complex data sharing, cross-border transfers)?",
      "type": "choice",
      "options": {
        "Yes, it still feels risky": {
          "decision": "DPIA_RECOMMENDED",
          "explanation": "A formal DPIA may not be strictly mandatory, but documenting a DPIA-style assessment will help you evidence that you considered risks and mitigations."
        },
        "No, it is clearly low risk": {
          "decision": "NO_DPIA_FORMAL",
          "explanation": "Based on your answers, a formal DPIA is unlikely to be required. Still keep a simple record of your reasoning and basic controls."
        }
      }
    }
  }
}}